{
    "version": "https://jsonfeed.org/version/1",
    "title": "SEO",
    "description": "",
    "home_page_url": "https://mpedrao.github.io/seo",
    "feed_url": "https://mpedrao.github.io/seo/feed.json",
    "user_comment": "",
    "author": {
        "name": "Maudy"
    },
    "items": [
        {
            "id": "https://mpedrao.github.io/seo/google-announces-new-update-that-targets-bad-content/",
            "url": "https://mpedrao.github.io/seo/google-announces-new-update-that-targets-bad-content/",
            "title": "Google announces new update that targets bad content",
            "summary": "Google's official blog announced this afternoon that it has started a new algorithm update for its search engine, with a focus on content quality. In Google's blog post, it says that: Update starts next week and should take two weeks to finish completely. The objective&hellip;",
            "content_html": "\n    <h2 id=\"googles-official-blog-announced-this-afternoon-that-it-has-started-a-new-algorithm-update-for-its-search-engine-with-a-focus-on-content-quality\">\n      Google's official blog announced this afternoon that it has started a new algorithm update for its search engine, with a focus on content quality.\n    </h2>\n\n  <p>\n    In <a href=\"https://developers.google.com/search/blog/2022/08/helpful-content-update\" target=\"_blank\">Google's blog post</a>, it says that:\n  </p>\n\n    <figure class=\"blockquote\">\n      <blockquote>\"Google Search is always working to better connect people to helpful information. To this end, we're launching what we're calling the “helpful content update” that's part of a broader effort to ensure people see more original, helpful content written by people, for people, in search results.\"</blockquote>\n      <figcaption>Google</figcaption>\n    </figure>\n\n  <p>\n    Update starts next week and should take two weeks to finish completely.\n<br>\n<br>The objective is to clean from the search results pages that will be considered bad, of low quality or that do not present answers to the users of the search engine of the American giant.\n  </p>\n\n  <p>\n    The update starts first in English and for other languages in the near future.\n<br>\n<br>Google will let us know on its official channels.\n  </p>\n\n  <p>\n    Bad news for those who use artificial intelligence textual content creation systems and who only think about creating articles thinking about search engines and not about humans.\n<br>\n<br>Poor people who copy recipes, travel blogs and so on.\n<br>\n<br>Are you sure about your original content?\n  </p>",
            "author": {
                "name": "Maudy"
            },
            "tags": [
                   "google"
            ],
            "date_published": "2022-08-18T15:35:57-03:00",
            "date_modified": "2022-08-18T15:50:14-03:00"
        }
    ]
}
